Catalogs/DMS_МакетыРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_МакетыРекламнойКампании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/DMS_СтатусыМакетовРекламныхКампаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СтатусыМакетовРекламныхКампаний</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыМакетовРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МакетРекламнойКампании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/DMS_РекламнаяКампания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_РекламнаяКампания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.DMS_РекламныеКампанииПредставителей</xr:Item>
				<xr:Item>AccumulationRegister.DMS_РекламныеКампании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПредложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыПредложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КооперативнаяРеклама</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедиаРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МедиаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРазмещенияМедиа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматМедиаРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ФорматыМедиаРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКампании</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтоимостьВзаиморасчеты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/DMS_МакетыРекламнойКампанииПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_МакетыРекламнойКампанииПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_МакетыРекламнойКампании/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("РекламнаяКампания") Тогда
		Объект.РекламнаяКампания = Параметры.РекламнаяКампания;
		РекламнаяКампанияПриИзмененииНаСервере();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Статус) И Статус <> Справочники.DMS_СтатусыМакетовРекламнойКампании.Заявлен 
		И Статус <> Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не Объект.ФайлКартинки.Пустая() Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки,"ФайлХранилище");
	Иначе
		АдресКартинки = "";
	Конецесли;
	
	Если Объект.Согласован Тогда
		Статус = Справочники.DMS_СтатусыМакетовРекламнойКампании.Согласован;
	Иначе 
		Статус = ТекущееСостояниеМакета(Объект.Ссылка);
	КонецЕсли; 
	
	Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Сохранить макет";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПрисоединенныйФайл" Тогда
		
		Модифицированность = Истина;
		СсылкаНаФайл = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
		
		Если ВыборИзображения Тогда
			
			Объект.ФайлКартинки = СсылкаНаФайл;
			АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки,"ФайлХранилище");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы") Тогда
		
		Объект.ФайлКартинки = ВыбранноеЗначение;
		АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки, "ФайлХранилище");
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_Макеты",Объект.РекламнаяКампания);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Согласован Тогда
		Статус = Справочники.DMS_СтатусыМакетовРекламнойКампании.Согласован;
	Иначе 
		Статус = ТекущееСостояниеМакета(Объект.Ссылка);
	КонецЕсли; 
	
	Элементы.ФормаЗаписатьИЗакрыть.Заголовок = "Сохранить макет";
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИзображение(Команда)
	
	Объект.ФайлКартинки = ПредопределенноеЗначение("Справочник.DMS_МакетыРекламнойКампании.ПустаяСсылка");
	АдресКартинки = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
		
    ИдентификаторФайла = Новый УникальныйИдентификатор;
    ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла);
		                                               
КонецПроцедуры

&НаКлиенте
Процедура ИзПрисоединенныхФайлов(Команда)
	
	ПараметрыФормы = Новый Структура("Отбор",Новый Структура("ВладелецФайла",Объект.Ссылка));
	ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы.ФормаВыбора",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
			
	ПросмотретьПрисоединенныйФайл(Элемент.Имя, Элемент.Имя,Объект.Ссылка,
		НСтр("ru='Отсутствует изображение для просмотра';en='No picture to show'"));
	
КонецПроцедуры

&НаСервере
Процедура РекламнаяКампанияПриИзмененииНаСервере()

	Объект.Представитель = Объект.РекламнаяКампания.Представитель;
	Объект.ДилерскийЦентр  = Объект.РекламнаяКампания.ДилерскийЦентр;

КонецПроцедуры // РекламнаяКампанияПриИзмененииНаСервере()

&НаСервереБезКонтекста
Функция ТекущееСостояниеМакета(МакетРекламнойКампании)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МакетРекламнойКампании", МакетРекламнойКампании);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыМакетовРекламныхКампанийСрезПоследних.Статус
		|ИЗ
		|	РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний.СрезПоследних(, МакетРекламнойКампании = &МакетРекламнойКампании) КАК СтатусыМакетовРекламныхКампанийСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Статус = Справочники.DMS_СтатусыМакетовРекламнойКампании.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Статус = ВыборкаДетальныеЗаписи.Статус;
	КонецЕсли; 
	
	Возврат Статус;
	
КонецФункции // ТекущееСостояниеМакета()

&НаКлиенте
Процедура РекламнаяКампанияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ",Объект.РекламнаяКампания);
	
	ОткрытьФорму("Документ.DMS_РекламнаяКампания.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьНаСогласованиеНаСервере(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	СогласованиеМакетов.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.DMS_СогласованиеМакетовРекламнойКампании КАК СогласованиеМакетов
		|ГДЕ
		|	СогласованиеМакетов.Предмет = &Предмет
		|	И НЕ СогласованиеМакетов.ПометкаУдаления
		|	И НЕ СогласованиеМакетов.Стартован
		|	И НЕ СогласованиеМакетов.Завершен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	БизнесПроцесс = БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.СоздатьБизнесПроцесс();
	БизнесПроцесс.Заполнить(Ссылка);
	
	БизнесПроцессСсылка = БизнесПроцессы.DMS_СогласованиеМакетовРекламнойКампании.ПолучитьСсылку();
	БизнесПроцесс.УстановитьСсылкуНового(БизнесПроцессСсылка);
	БизнесПроцесс.ОбменДанными.Загрузка = Истина;
	БизнесПроцесс.Записать();
	
	Возврат БизнесПроцессСсылка;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Предупреждение("Сначала необходимо записать макет",15,"Внимание");
		Возврат;
	КонецЕсли; 
	
	СсылкаБизнесПроцесс = ОтправитьНаСогласованиеНаСервере(Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Ключ",СсылкаБизнесПроцесс);	
	ОткрытьФорму("БизнесПроцесс.DMS_СогласованиеМакетовРекламнойКампании.Форма.ФормаБизнесПроцесса",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлы(СсылкаНаМакет, ИдентификаторФайла)
	                 
	ВладелецФайла = СсылкаНаМакет;
	ИдентификаторФормы = ИдентификаторФайла;
	
	Фильтр = DMS_РекламныеКампанииКлиент.ФильтрФайловИзображений();
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Истина;
	ВыборФайла.Заголовок = НСтр("ru='Выбор файла';en='file selection'");
	ВыборФайла.Фильтр = ?(ЗначениеЗаполнено(Фильтр), Фильтр, НСтр("ru='Все файлы';en='All files'") + " (*.*)|*.*");
	
	Если ВыборФайла.Выбрать() Тогда
		ПрисоединенныеФайлыМассив = Новый Массив;
		ПоместитьВыбранныеФайлыВХранилище(
		ВыборФайла.ВыбранныеФайлы,
		ВладелецФайла,
		ПрисоединенныеФайлыМассив,
		ИдентификаторФормы);
		
		Если ПрисоединенныеФайлыМассив.Количество() = 1 Тогда
			ПрисоединенныйФайл = ПрисоединенныеФайлыМассив[0];
			
			ПоказатьОповещениеПользователя(
			НСтр("ru='Создание:';en='Creature:'"),
			ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл),
			ПрисоединенныйФайл,
			БиблиотекаКартинок.Информация32);
			
			АдресКартинки = ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл, "ФайлХранилище");
			
			ПараметрыФормы = Новый Структура("Ключ", ПрисоединенныйФайл);
			ОткрытьФорму("Справочник.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
			
		КонецЕсли;
		
		Если ПрисоединенныеФайлыМассив.Количество() > 0 Тогда
			ОповеститьОбИзменении(ПрисоединенныеФайлыМассив[0]);
			Оповестить("Запись_ПрисоединенныйФайл", Новый Структура("ЭтоНовый", Истина), ПрисоединенныеФайлыМассив);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьФайлы()

&НаКлиенте
Процедура ПоместитьВыбранныеФайлыВХранилище(Знач ВыбранныеФайлы,
                                            Знач ВладелецФайла,
                                            ПрисоединенныеФайлыМассив,
                                            Знач ИдентификаторФормы) Экспорт
		
	ДвоичныйФайл = Новый ДвоичныеДанные(ВыбранныеФайлы[0]);
	
	Файл = Новый Файл(ВыбранныеФайлы[0]);	
	
	СтруктураФайла = Новый Структура("Файл,Имя,Размер,Расширение",ДвоичныйФайл,Файл.ИмяБезРасширения,Файл.Размер(),Файл.Расширение);
	
	ПрисоединенныйФайл = СоздатьПрисоединенныйФайл(СтруктураФайла,ВладелецФайла);
	
	Объект.ФайлКартинки = ПрисоединенныйФайл; 
	
	ПрисоединенныеФайлыМассив.Добавить(ПрисоединенныйФайл);
	
	Файл = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПрисоединенныйФайл(СтруктураФайла,ВладелецФайла)
		
	ОбъектФайл = Справочники.DMS_МакетыРекламнойКампанииПрисоединенныеФайлы.СоздатьЭлемент();
	ОбъектФайл.ВладелецФайла = ВладелецФайла;
	ОбъектФайл.Наименование  = СтруктураФайла.Имя;
	ОбъектФайл.Размер 		 = СтруктураФайла.Размер;
	ОбъектФайл.Расширение    = СтрЗаменить(СтруктураФайла.Расширение,".","");
	ОбъектФайл.ФайлХранилище = Новый ХранилищеЗначения(СтруктураФайла.Файл,Новый СжатиеДанных(9));
		
	ОбъектФайл.ОбменДанными.Загрузка = Истина;
	ОбъектФайл.Записать();
	
	Возврат ОбъектФайл.Ссылка;
	
КонецФункции // СоздатьПрисоединенныйФайл()

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы,ВладелецПрисоединенныйФайл, ТекстСообщенияОбОшибке)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизитаОбъекта]) Тогда
		
		ДанныеФайла = ПолучитьДанныеПрисоединенногоФайла(ВладелецПрисоединенныйФайл.ФайлКартинки);
		
		ИмяВременногоФайла =  ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
		ДанныеФайла.Файл.Записать(ИмяВременногоФайла);
		
		ЗапуститьПриложение(ИмяВременногоФайла);
		
		// УдалитьФайлы(ИмяВременногоФайла);
		
	Иначе
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке,, ИмяРеквизитаФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПрисоединенногоФайла(ПрисоединенныйФайл)

	Возврат Новый Структура("Файл,Расширение",ПрисоединенныйФайл.ФайлХранилище.Получить(),ПрисоединенныйФайл.Расширение)

КонецФункции // ПолучитьДанныеПрисоединенногоФайла()
